app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(school_class_params)

		if @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["room_number", 0], ["created_at", "2020-08-06 05:14:53.784120"], ["updated_at", "2020-08-06 05:14:53.784120"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        if @school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "poo"], ["room_number", 0], ["updated_at", "2020-08-07 02:08:49.134798"], ["id", 10]]