app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "bob"], ["last_name", "sponge"], ["created_at", "2020-08-06 05:19:22.412767"], ["updated_at", "2020-08-06 05:19:22.412767"]]
---
    def create
        @student = Student.new(student_params)
		if @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "woman"], ["updated_at", "2020-08-07 01:48:55.732700"], ["id", 10]]
---
    def update
        @student = Student.find(params[:id])
        if @student.update(student_params)